"""Convert WikiMed data to IFT format."""

from typing import Dict

import os
import re
import random
from os.path import join
from tqdm import tqdm
import json
import click
import pandas as pd


PRE = [
    "",
    "Ты являешься врачом.",
    "Ты являешься профессиональным врачом.",
]


INSTRUCTIONS_DIS_RU = {
    "Этиология и патогенез": [
        "Напиши описание патогенеза заболевания",
        "Сформулируй описание механизма развития болезни.",
        "Изложи процесс возникновения и развития недуга.",
        "Опишите последовательность возникновения и прогрессирования заболевания.",
        "Дай описание пути, которым болезнь проявляется и развивается.",
        "Проиллюстрируй шаги патогенеза данного заболевания.",
    ],
    "Клинические проявления": [
        "Напиши клинические проявления заболевания",
        "Опиши симптомы и признаки болезни.",
        "Изложи клиническую картину заболевания.",
        "Перечисли проявления, характерные для данного недуга.",
        "Детализируй клинические симптомы, связанные с болезнью.",
        "Опиши характерные клинические признаки, которые наблюдаются при этом заболевании.",
    ],
    "Диагностика": [
        "Напиши диагностику заболевания",
        "Опишит методы диагностирования болезни.",
        "Изложи подходы к выявлению данного заболевания.",
        "Перечисли процедуры и тесты для диагностики недуга.",
        "Дай описание инструментов, используемых для определения болезни.",
        "Проиллюстрируй способы обнаружения клинических признаков заболевания.",
    ],
    "Дифференциальный диагноз": [
        "Напиши дифференциальный диагноз заболевания",
        "Опиши методику дифференциации данного заболевания от других.",
        "Изложи принципы проведения дифференциального диагноза для этой болезни.",
        "Перечисли критерии для различения данного недуга от схожих состояний.",
        "Дай описание процесса дифференциальной диагностики болезни.",
        "Проиллюстрируй подходы к определению дифференциального диагноза заболевания.",
    ],
    "Лечение": [
        "Напиши лечение заболевания",
        "Опиши терапевтические подходы к лечению болезни.",
        "Изложи методы лечения данного заболевания.",
        "Перечисли применяемые лекарства и процедуры для терапии недуга.",
        "Дай описание стратегий медикаментозного и не медикаментозного лечения болезни.",
        "Проиллюстрируй план действий для лечения данного заболевания.",
    ],
    "Профилактика": [
        "Напиши профилактику заболевания",
        "Опиши меры предотвращения данного заболевания.",
        "Изложи методы профилактики этой болезни.",
        "Перечисли рекомендации по предупреждению недуга.",
        "Дай описание действий для предотвращения развития болезни.",
        "Проиллюстрируй стратегии сохранения здоровья для избежания этого заболевания.",
    ],
    "Действующие вещества": [
        "Напиши действующие вещества для заболевания",
        "Перечисли активные компоненты, используемые при лечении болезни.",
        "Опиши активные ингредиенты, применяемые для терапии этого заболевания.",
        "Изложи список действующих веществ, назначаемых при данном недуге.",
        "Дай описание эффективных молекул для лечения болезни.",
        "Проиллюстрируй препараты с активными составляющими для борьбы с заболеванием.",
    ],
}

INSTRUCTIONS_DIS_ENG = {
    "Этиология и патогенез": "pathogenesis",
    "Клинические проявления": "manifestations",
    "Диагностика": "diagnostics",
    "Дифференциальный диагноз": "differential",
    "Лечение": "treatment",
    "Профилактика": "prevention",
    "Действующие вещества": "acting_meds",
}


INSTRUCTIONS_DRG_RU = {
    "Фармакологическая группа": [
        "Напиши фармакологическую группу вещества",
        "Укажи группу фармакологических средств, к которой относится вещество.",
        "Опиши классификацию фармакологической группы данного вещества.",
        "Перечисли категорию фармакологической принадлежности вещества.",
        "Дай описание фармакологической категории, к которой принадлежит вещество.",
        "Проиллюстрируй фармакологическую группировку, в которую входит вещество.",
    ],
    "Характеристика вещества": [
        "Напиши характеристики вещества",
        "Опиши свойства данного вещества.",
        "Изложи основные атрибуты химического состава вещества.",
        "Перечисли физико-химические характеристики вещества.",
        "Дай описание качественных и количественных характеристик вещества.",
        "Проиллюстрируй особенности и параметры данного вещества.",
    ],
    "Фармакология": [
        "Опиши фармакологию вещества",
        "Изложи фармакологические свойства вещества.",
        "Перечисли фармакодинамику и фармакокинетику вещества.",
        "Опиши механизм действия и эффекты вещества на организм.",
        "Дай описание взаимодействия вещества с биологическими системами.",
        "Проиллюстрируй как вещество влияет на физиологические процессы.",
    ],
    "Применение": [
        "Напиши показания к применению вещества",
        "Опиши случаи, когда применение вещества является рекомендованным.",
        "Изложи ситуации или состояния, при которых вещество назначается.",
        "Перечисли условия, для лечения которых предписывается это вещество.",
        "Дай описание клинических сценариев, где использование вещества показано.",
        "Проиллюстрируй области применения вещества в медицинской практике."
    ],
    "Противопоказания": [
        "Перечисли противопоказания вещества",
        "Опиши условия, при которых использование вещества недопустимо.",
        "Изложи случаи, когда применение вещества противопоказано.",
        "Перечисли ограничения к использованию данного вещества.",
        "Дай описание ситуаций, при которых вещество не должно применяться.",
        "Проиллюстрируй обстоятельства, исключающие использование вещества.",
    ],
    "Побочные действия": [
        "Перечисли побочные действрия вещества",
        "Опиши возможные нежелательные эффекты от использования вещества.",
        "Изложи известные побочные реакции на вещество.",
        "Перечисли негативные проявления, связанные с применением вещества.",
        "Дай описание возможных нежелательных последствий приема вещества.",
        "Проиллюстрируй типичные побочные эффекты, которые может вызвать вещество.",
    ],
    "Взаимодействие": [
        "Опиши взаимодействие вещества с другими",
        "Изложи информацию о взаимодействии данного вещества с другими препаратами.",
        "Перечисли известные взаимодействия вещества с другими химическими соединениями.",
        "Опиши потенциальные реакции вещества при совместном использовании с другими веществами.",
        "Дай описание синергетических или антагонистических эффектов при комбинировании вещества с другими.",
        "Проиллюстрируй, как вещество может взаимодействовать с другими лекарственными средствами или добавками.",
    ],
    "Способ применения и дозы": [
        "Напиши способ применения и дозы для вещества",
        "Опиши методику использования и дозировки вещества.",
        "Изложи инструкции по применению вещества и рекомендуемые дозы.",
        "Перечисли режим дозирования и способы администрирования вещества.",
        "Дай описание протоколов приема и дозирования данного вещества.",
        "Проиллюстрируй направления по использованию и определению доз вещества.",
    ],
    "Меры предосторожности": [
        "Опиши меры предосторожности для вещества",
        "Изложи рекомендации по безопасному использованию вещества.",
        "Перечисли предостережения, связанные с применением вещества.",
        "Опиши необходимые предосторожности при работе с веществом.",
        "Дай описание мер безопасности для обращения с веществом.",
        "Проиллюстрируй инструкции по предупреждению рисков при использовании вещества.",
    ],
    "МКБ-10": [
        "Перечисли заболевания для которых может применяться вещество",
        "Опиши болезни, при лечении которых используется это вещество.",
        "Изложи список заболеваний, для терапии которых применяется вещество.",
        "Перечисли недуги, в лечении которых эффективно данное вещество.",
        "Дай описание патологий, при которых рекомендуется использование вещества.",
        "Проиллюстрируй заболевания, для которых назначается это вещество.",
    ],
}

INSTRUCTIONS_DRG_ENG = {
    "Фармакологическая группа": "drug_pharm_group",
    "Характеристика вещества": "drug_char",
    "Фармакология": "drug_pharmacology",
    "Применение": "drug_usage",
    "Противопоказания": "drug_neg",
    "Побочные действия": "drug_neg_symp",
    "Взаимодействие": "drug_connection",
    "Способ применения и дозы": "drug_dosage",
    "Меры предосторожности": "dgug_cautiuons",
    "МКБ-10": "drug_diseases",
}


def prepare_name(disease_name: str) -> str:
    disease_name = disease_name.replace(
        "Злокач. новообр.", "Злокачественное новообразование"
    )
    disease_name = disease_name.replace("вызв.", "вызванный")

    disease_name = (
        disease_name.removeprefix("Другие")
        .replace(", не классифицированные в других рубриках", "")
        .strip()
    )
    # Remove ICD code from name:
    disease_name = re.sub(r"\([A-Z][0-9]+(\.[0-9\-]+)?[\+\*]?\)", "", disease_name)
    return disease_name


def get_sample(data: pd.Series, instruction_type: str, codes: pd.DataFrame) -> Dict:
    icd_code = data["МКБ-10"]
    dis_name = codes.query("mkb_cod == @icd_code")
    if dis_name.shape[0] > 0:
        name = dis_name["mkb_name"].values[0]
    else:
        name = data["Рубрика"]

    input = prepare_name(name)

    pre = random.choice(PRE)
    instruction = random.choice(INSTRUCTIONS_DIS_RU[instruction_type])
    instruction = pre + " " + instruction if pre else instruction

    output = data[instruction_type]
    output = output.replace("\n", " ")
    sample = {"instruction": instruction, "input": input, "output": output}
    return sample


def get_drug_sample(data: pd.Series, instruction_type: str) -> Dict:
    input = data["Название"]

    pre = random.choice(PRE)
    instruction = random.choice(INSTRUCTIONS_DRG_RU[instruction_type])
    instruction = pre + " " + instruction if pre else instruction
    
    output = data[instruction_type]
    output = output.replace("\n", " ")

    # Remove IDC codes:
    output = re.sub(r'\b[A-Z]\d+(?:\.\d+)?\*?\b', '', output).strip()

    sample = {"instruction": instruction, "input": input, "output": output}
    return sample


def generate_data_for_diseases(wikimed_path: str, codes_path: str, results_dir: str):
    os.makedirs(results_dir, exist_ok=True)

    codes = pd.read_csv(codes_path)
    wikimed = pd.read_csv(wikimed_path)

    for instruction_type in tqdm(INSTRUCTIONS_DIS_RU.keys()):
        result = []

        wikimed_data = wikimed.dropna(subset=[instruction_type], axis=0, inplace=False)
        for idx in wikimed_data.index:
            data = wikimed_data.loc[idx]
            sample = get_sample(data, instruction_type, codes)
            result.append(sample)

        result_name = INSTRUCTIONS_DIS_ENG[instruction_type]
        with open(join(results_dir, result_name + ".json"), "w", encoding="utf8") as f:
            json.dump(result, f, indent=3, ensure_ascii=False)

        print(f"Prepared {len(result)} samples for {result_name}.")


def generate_data_for_drugs(wikimed_drugs_path: str, results_dir: str):
    os.makedirs(results_dir, exist_ok=True)

    wikimed = pd.read_csv(wikimed_drugs_path)

    for instruction_type in tqdm(INSTRUCTIONS_DRG_RU.keys()):
        result = []

        wikimed_data = wikimed.dropna(subset=[instruction_type], axis=0, inplace=False)
        for idx in wikimed_data.index:
            data = wikimed_data.loc[idx]
            sample = get_drug_sample(data, instruction_type)
            result.append(sample)

        result_name = INSTRUCTIONS_DRG_ENG[instruction_type]
        with open(join(results_dir, result_name + ".json"), "w", encoding="utf8") as f:
            json.dump(result, f, indent=3, ensure_ascii=False)

        print(f"Prepared {len(result)} samples for {result_name}.")


@click.command()
@click.option("--wikimed-path", default="data/data_raw/wikimed/wikimed_diseases.csv")
@click.option("--wikimed-drugs-path", default="data/data_raw/wikimed/wikimed_meds.csv")
@click.option("--codes-path", default="data/data_raw/spr_mkb10.csv")
@click.option(
    "--results-dir",
    default="data/data_ift/wikimed/",
)
def generate_data(
    wikimed_path: str, wikimed_drugs_path: str, codes_path: str, results_dir: str
) -> None:
    os.makedirs(results_dir, exist_ok=True)
    generate_data_for_drugs(wikimed_drugs_path, results_dir)
    generate_data_for_diseases(wikimed_path, codes_path, results_dir)


if __name__ == "__main__":
    generate_data()
